# Taps to make cask work
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"

brew "git"
brew "mas"

brew "node"
brew "yarn"
brew "gnupg"
brew "mongodb"
brew "watchman"
brew "yadm"
brew "todo-txt"
brew "neovim"
brew "zsh"
brew "antigen"
brew "tmux"
brew "python2"
brew "python3"
brew "mosh"
brew "awscli"
brew "nvm"
brew "elm"

cask "skype"
cask "google-chrome"
cask "opera"
cask "vlc"
cask "keycastr"
cask "grammarly"
cask "1password"
cask "caffeine"
cask "duet"
cask "omnifocus"
cask "fantastical"
cask "iterm2"
cask "speedify"
cask "visual-studio-code"
cask "dash"
cask "zoomus"
cask "messenger"
cask "Paw"
cask "steveschow-gfxcardstatus"
cask "Slack"
cask "docker"
cask "LaunchBar"
cask "obs"
cask "graphql-playground"
cask "charles"
cask "firefox"
cask "kap"
cask 'franz'
cask 'istat-menus'
cask 'hazel'
cask 'atom'
cask 'flux'
cask 'recordit'
cask 'bartender'

mas "Harvest", id: 506189836
mas "Magnet", id: 441258766
mas "Speedtest", id: 1153157709
mas "Bear", id: 1091189122
mas "Day One", id: 1055511498
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
mas "Pocket", id: 568494494
mas 'Copy"em Paste', id: 876540291
mas 'BreakTime', id: 427475982
mas 'Spark', id: 1176895641
mas 'Pages', id: 409201541
mas 'Ulysses', id: 1225570693 
mas 'Freckle', id: 879917538
mas 'Tick Time Tracking (1.2)', id: 993200850 
mas 'DaisyDisk (4.6.5)', id: 411643860 

