tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "supabase/tap"
tap "dopplerhq/cli"
tap "facebook/fb"


# Needed for yadm decrypt
brew "gpg"
brew "yadm"

brew "git"
brew "mas"

brew "watchman"
brew "neovim"
brew "zsh"
brew "antigen"
brew "asdf"
brew "gh"
brew "starship"

brew "terminal-notifier"
brew "shellcheck"
brew "organize-tool"
brew "doppler"
brew "sonar-scanner"
brew "idb-companion"
brew "modularml/packages/modular"
brew "flyctl"


cask "orbstack"
cask "fantastical"
cask "1password"
cask "visual-studio-code"
cask "zoom"
cask "Paw"
cask "graphql-playground"
cask "warp"
cask "ngrok"
cask "slack"
cask "microsoft-edge"
cask "tg-pro"
cask "raycast"
cask "font-cascadia-code"
cask "expressvpn"
cask "sigmaos"
cask "setapp"
cask "hey"
cask "telegram"
cask "whatsapp"
cask "logi-options-plus"
cask "github"
cask "cursor"
cask "obsidian"
cask "provisionql"

# Conpago
cask "around"
brew "jq"
cask "google-cloud-sdk"

# Intellecti
brew "supabase"
cask "flutter"
brew "lcov"
brew "firebase-cli"
brew "bundletool"

# Fun
cask "steam"
cask "nvidia-geforce-now"
cask "microsoft-teams"

mas "Magnet", id: 441258766
mas "Day One", id: 1055511498
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Endel", id: 1346247457
mas 'iAWriter', id: 775737590
