tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "mongodb/brew"
tap "wix/brew"
tap "1password/tap/1password-cli"

brew "git"
brew "mas"

brew "gnupg"
brew "watchman"
brew "yadm"
brew "neovim"
brew "zsh"
brew "antigen"
brew "tmux"
brew "mosh"
brew "asdf"
brew "gh"
brew "starship"
brew "postgresql"
brew "dopplerhq/cli/doppler"

brew "watchexec"
brew "direnv"
brew "terminal-notifier"
brew "shellcheck"

cask "fantastical"
cask "fig"
cask "google-chrome"
cask "grammarly"
cask "1password"
cask "visual-studio-code"
cask "zoom"
cask "Paw"
cask "graphql-playground"
cask "hyper"
cask "ngrok"
cask "choosy"
cask "microsoft-teams"
cask "slack"
cask "microsoft-edge"
cask "tg-pro"
cask "speedify"
cask "mongodb-compass"
cask "raycast"
cask 'expressvpn'
cask "1password-cli"

# Flutter
cask "flutter"
brew "applesimutils"

# Elixir
# Hound
cask 'chromedriver'

# Membrane framework
brew "ffmpeg"
brew "portaudio"
brew "mad"

mas "Magnet", id: 441258766
mas "Day One", id: 1055511498
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Endel", id: 1484348796
#mas 'iAWriter', id: 775737590
