# Taps to make cask work
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'

brew "mas"

brew "git"
brew "node"
brew "yarn"
brew "gnupg"
brew "mongodb"

cask "skype"
cask "google-chrome"
cask "opera"
cask "vlc"

mas "Monit", id: 1014850245
mas "Harvest", id: 506189836
mas "Magnet", id: 441258766
mas "Speedtest", id: 1153157709
mas "Bear", id: 1091189122
mas "Day One", id: 1055511498
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
mas "Pocket", id: 568494494
mas "Copy'em Paste", id: 876540291
